

rect_2ug = [

['гибкая вставка', 'A', 'B', 'EH', 'BH', 'FL', 'qty','материал', 'rect_fej'], 
['фланец газохода','Amax', 'Bmax' , 'Amin', 'Bmin', 'thick','кол-во', 'материал',  'rect_fl'], 
['прижимная планка','Amax', 'Bmax' , 'Amin', 'Bmin', 'thick','кол-во', 'материал',  'rect_cfl'], 
['Дефлектор', 'Amax','Bmax', 'Amin', 'Bmin', 'угол','длинна ', 'тольщина листа ','количество' ,'материал' ,'rect_def'], 
['болтовое соединение', 'количество' ,'размер' ,'circle_bolting'], 

]


circ_2ug = [
['тканевый компенсатор', 'Ø', 'FL', 'EH','BH' , 'количество' ,'материал' ,'circle_fej'], 
# ['Фланец газохода', 'Dmin', 'Dmax', 'толщина','количество' ,'материал' ,'circle_fl'], 
# ['прижимная планка', 'Dmin', 'Dmax', 'толщина','количество' ,'материал' ,'circle_сfl'], 
# ['Дефлектор', 'Dmax','Dmin', 'угол','длинна ', 'тольщина листа ','количество' ,'материал' ,'rect_def'], 
# ['болтовое соединение', 'количество' ,'размер' ,'circle_bolting'], 



]

exp_type = {'rect': rect_2ug, 'circ':circ_2ug}
