


# БК-182448




rect_2ug = [

# ['гибкая вставка', 'A', 'B', 'EH', 'C','rect_fej'], 
# ['фланец газохода', 'Amin', 'Bmin', 'thick', 'Amax', 'Bmax' , 'rect_flange'], 
# ['прижимная планка', 'Amin', 'Bmin', 'thick', 'Amax', 'Bmax' , 'rect_flange'], 
# ['крепеж','количество крепежа','bolting_calc'] 

]


circ_2ug = [
['тканевый компенсатор', 'Ø', 'FL', 'EH','BH' , 'количество' ,'материал' ,'circle_fej'], 
['Фланец газохода', 'Dmin', 'Dmax', 'толщина','количество' ,'материал' ,'circle_fl'], 
['прижимная планка', 'Dmin', 'Dmax', 'толщина','количество' ,'материал' ,'circle_сfl'], 
['Дефлектор', 'Dmax','Dmin', 'угол','длинна ', 'тольщина листа ','количество' ,'материал' ,'circle_def'], 
['болтовое соединение', 'количество' ,'размер' ,'circle_bolting'], 



]

exp_type = {'rect': rect_2ug, 'circ':circ_2ug}
